In [3]:
import numpy as np

def numpysum(n):
    a = np.arange(n) ** 2
    b = np.arange(n) ** 3
    c = a + b
    return c

print(numpysum(2))

[0 2]

In [2]:
import pandas  as pd
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,7,-5,3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [8]:
obj2['a']

-5

In [9]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [10]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [11]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [12]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [15]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [5]:
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data[0]=None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
              [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))

In [19]:
df

          0         1         2
0 -0.733762  1.633531  2.536959
1 -1.483933  0.673927 -1.261877
2  0.390734 -0.764673  0.517024
3  0.595559  0.562193  0.962359
4  0.273106  0.550762 -0.145859
5  0.767378 -0.066348  0.392528
6  0.233531  1.388220  1.204202

In [20]:
df.iloc[:4, 1] = NA
df

          0         1         2
0 -0.733762       NaN  2.536959
1 -1.483933       NaN -1.261877
2  0.390734       NaN  0.517024
3  0.595559       NaN  0.962359
4  0.273106  0.550762 -0.145859
5  0.767378 -0.066348  0.392528
6  0.233531  1.388220  1.204202

In [21]:
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.733762       NaN       NaN
1 -1.483933       NaN       NaN
2  0.390734       NaN  0.517024
3  0.595559       NaN  0.962359
4  0.273106  0.550762 -0.145859
5  0.767378 -0.066348  0.392528
6  0.233531  1.388220  1.204202

In [22]:
df.dropna()

          0         1         2
4  0.273106  0.550762 -0.145859
5  0.767378 -0.066348  0.392528
6  0.233531  1.388220  1.204202

In [23]:
df.dropna(thresh=2)

          0         1         2
2  0.390734       NaN  0.517024
3  0.595559       NaN  0.962359
4  0.273106  0.550762 -0.145859
5  0.767378 -0.066348  0.392528
6  0.233531  1.388220  1.204202

In [24]:
df.fillna(0)

          0         1         2
0 -0.733762  0.000000  0.000000
1 -1.483933  0.000000  0.000000
2  0.390734  0.000000  0.517024
3  0.595559  0.000000  0.962359
4  0.273106  0.550762 -0.145859
5  0.767378 -0.066348  0.392528
6  0.233531  1.388220  1.204202

In [25]:
df.fillna({1: 0.5, 2: 0})
df

          0         1         2
0 -0.733762       NaN       NaN
1 -1.483933       NaN       NaN
2  0.390734       NaN  0.517024
3  0.595559       NaN  0.962359
4  0.273106  0.550762 -0.145859
5  0.767378 -0.066348  0.392528
6  0.233531  1.388220  1.204202

In [26]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                                  'Pastrami', 'corned beef', 'Bacon',
                                  'pastrami', 'honey ham', 'nova lox'],
                         'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
data.index[3]

3

In [29]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [30]:
lowercased = data['food'].str.lower()

In [31]:
data['food']

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [32]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                        index=['Ohio', 'Colorado', 'New York'],
                        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [35]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [36]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [37]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [38]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [39]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [40]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [41]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [42]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [43]:
import numpy as np
data = np.random.rand(20)
data

array([0.60644836, 0.70322274, 0.68448221, 0.76852959, 0.78689582,
       0.979673  , 0.30868911, 0.56166321, 0.20288398, 0.09645826,
       0.82411868, 0.45765006, 0.23049113, 0.81445388, 0.98864258,
       0.68126348, 0.3702463 , 0.7622349 , 0.83049553, 0.12341142])

In [44]:
pd.cut(data, 4, precision=2)

[(0.54, 0.77], (0.54, 0.77], (0.54, 0.77], (0.77, 0.99], (0.77, 0.99], ..., (0.54, 0.77], (0.32, 0.54], (0.54, 0.77], (0.77, 0.99], (0.096, 0.32]]
Length: 20
Categories (4, interval[float64]): [(0.096, 0.32] < (0.32, 0.54] < (0.54, 0.77] < (0.77, 0.99]]

In [45]:
data = np.random.randn(1000)

In [46]:
data

array([ 0.20312115, -0.38971576, -0.48353349, -0.92549771, -0.08981121,
        0.79886133, -0.70906046,  0.04044397, -0.85044022, -0.67879739,
        0.85707329,  1.69648111, -1.26466172, -1.20588847,  0.66462665,
        1.04391973, -0.20769499,  0.12137958,  0.44147835,  3.33159293,
        0.10465387,  1.42243177, -1.61818797,  0.17069871, -0.73840036,
        0.90289414,  1.6858946 ,  1.70106865,  0.37602514,  0.70835128,
        2.80402675,  1.17564273,  0.66666863, -0.27086936,  0.93123875,
        0.50221332, -1.8928399 ,  0.3860242 ,  0.02951646,  0.82026146,
        0.22182026,  1.27095974,  0.99751183, -0.42397581,  0.22490362,
        2.36988338, -1.27182055,  0.37983569, -1.49095502, -1.22687186,
        2.25238552, -0.4554112 ,  1.15624093, -0.0903784 ,  0.10312053,
       -0.29550092,  0.31984937, -0.76913249, -0.64870597,  0.9361956 ,
       -0.65619655, -2.49255343,  0.95542246,  0.05882355, -0.10322974,
        1.90630716,  0.8635408 ,  0.96306392,  0.19486557, -0.47214895,
        0.31592403, -1.46800898,  0.26015102,  0.18817864,  0.56339005,
       -0.01758147,  1.39652355, -0.4904023 ,  0.26582077, -0.72479466,
       -0.12344881, -0.71859772, -0.22176673,  0.85692687,  0.41751236,
       -0.32693502,  0.00700429,  1.18364145, -0.55907015, -0.1974533 ,
        0.53838102, -0.73996608, -1.11383708, -0.38143961,  0.79388678,
        1.24730718, -0.24051868, -0.3596347 , -1.39696199, -0.17172239,
       -1.03654514,  0.96607133,  1.77048907, -0.8018841 , -0.86108728,
       -0.80932771, -1.41665395, -0.34623712, -1.11491148,  0.33244769,
        0.32482704,  0.66564487, -0.27837158, -0.54704976, -1.40110978,
        0.67363141, -1.52158553,  0.26051049,  0.01341691, -0.45726151,
        0.36395587,  0.11515937,  1.8596136 ,  1.18257358, -0.39982381,
        0.17248579, -0.70633667, -0.20793881,  1.6482303 , -0.82666908,
        0.28955414,  0.0976305 , -0.81553933, -0.27083923,  0.41185342,
        0.50450122, -0.06446474,  1.32866437,  0.16290475,  1.22786511,
       -0.29386163,  0.13826829,  0.76856548,  0.98564982, -1.01461589,
        2.26125338, -1.21699244, -0.19363471,  1.26643662, -1.06468269,
        1.39344062, -1.32917426, -0.18424151,  0.51069562,  0.73154923,
       -0.53329286, -0.04276468, -0.62205166, -0.17894051, -1.57214728,
       -0.57034618, -0.25900856,  0.82862838,  0.51534061,  1.10817379,
        0.45041028, -0.81905397,  0.88213591,  0.32210383,  0.24184129,
       -1.97876978, -0.82055788, -0.46215067, -1.28807271, -0.72538001,
        0.01296422, -1.57000415,  0.95127059, -0.49218935, -1.24208935,
       -0.74004709,  0.13022599, -1.08634212, -0.59107644, -0.87415872,
        0.83552947, -1.42894362, -2.15756226,  0.04477072, -1.12004536,
        0.84114634, -1.19549496, -0.6795927 , -0.76792257, -1.74340473,
        1.30357202,  0.05785964, -0.60840238,  0.52590891,  0.02562907,
        0.77511656,  1.83247287, -0.04532293,  0.22947772,  0.63857893,
        0.00526379, -1.45904359,  1.29422217, -0.32954994, -0.21992381,
       -0.17831487,  1.93322742, -1.11328915, -1.30723882,  1.06501736,
       -1.24600719,  1.51363011, -1.30955988,  0.30203888, -1.2004653 ,
       -0.55731724,  1.04047326,  0.77514872, -1.80678804,  1.8365238 ,
        1.0218851 ,  0.74872656, -0.97318492,  0.10819719,  0.96297886,
       -1.27595079, -0.13903265,  0.57628798, -1.02028747, -1.31857848,
        1.02776185, -0.03557776, -1.03360024,  0.98997248,  1.46809437,
       -1.35991704, -0.75597006,  0.11102975,  0.25433584, -2.62800244,
       -1.34665329,  0.6213186 ,  0.07180347,  0.63446306,  1.29005691,
       -1.23474626,  0.84813796,  0.71521457,  0.0411127 , -2.0624295 ,
        1.13802372,  0.49036144,  0.02583011, -0.06445523,  0.34228595,
        1.77756144, -0.00706941,  0.94618264,  0.40533442, -1.10383171,
       -0.6790167 ,  0.14887376,  1.07463062,  0.87653662,  0.33933863,
       -1.25372891,  1.46596485,  0.30696242,  0.18632055,  1.05188918,
        0.61556526,  0.5762459 ,  1.43553852,  0.19584389,  0.34140123,
       -0.05825699, -0.36072134, -0.20426288, -0.08411412,  0.86194196,
       -3.82670705,  0.12145875,  0.64624722, -1.52918052,  0.392877  ,
        0.47084342, -0.93319019, -0.88905876, -2.22866117, -1.08006668,
       -1.13709844, -0.68858369,  0.50720811, -0.05597062, -0.11360498,
       -0.30145609,  0.29072146,  0.68214374,  0.5550662 ,  1.67132827,
        0.02364501,  1.91022831,  0.62165998,  0.88035127, -0.66886482,
        0.86893357,  0.85877477, -0.71021592,  0.56664   , -1.84971355,
        0.48947435,  1.14132582, -0.99854158, -0.63384126,  1.13893738,
        0.19521637, -1.24259644, -0.72331522, -1.05404874,  0.40634439,
        1.08140653,  1.44265306, -0.8405956 ,  1.12549779,  1.32390153,
        1.45276882, -0.21772778, -1.06467968,  1.03524492,  0.44890737,
       -1.11445416, -0.56905038,  0.74345152, -0.27169016, -0.90502829,
       -0.16363158, -1.9698029 , -0.8458795 ,  0.91254419, -1.19605807,
       -0.32970712, -0.18106275, -0.40384658,  0.55544459,  0.81883257,
       -0.05369416, -1.71863098,  0.5967757 , -0.21474405, -0.60556373,
       -0.01176167, -0.21335749,  0.73021244, -0.07693931, -0.16773224,
       -1.57108382,  0.79390688,  1.10968747,  0.0825035 ,  1.76720984,
       -0.94224129, -0.83847766,  0.16827075, -0.8900729 , -2.1010011 ,
        1.40900416, -0.83080242,  0.86598104,  0.38973536, -1.52645836,
       -0.33184685,  0.56873898, -1.08585302,  0.65330418,  0.39227278,
        0.43712448,  1.19929258,  0.86694687, -0.44704176, -0.71465357,
        0.97815434,  0.37660345, -0.44251655,  0.02991871, -0.37949356,
        0.53543346,  2.13658813, -1.03593859,  1.63628372, -1.54417337,
       -0.61810678, -0.64001484,  0.97435892,  1.01857136,  2.08714718,
       -0.22415447,  0.76024247, -0.23980154, -1.02292565,  1.12357878,
       -0.41692523, -0.37533439,  1.01985167, -0.03693475,  0.53992048,
        0.60778819, -2.2994646 , -1.18227007, -1.87283979, -0.96925329,
       -1.22683327, -0.8927541 ,  1.13576887, -0.55790114, -0.04862659,
        0.26379842, -0.14751617, -0.25284194,  0.54358777,  0.23195458,
        1.15945599, -0.39570112,  0.52370893,  1.13019144,  1.9204658 ,
       -0.0312566 , -0.27694951, -0.21653848, -0.36137035,  0.91373783,
        0.7096022 , -1.8699417 , -0.96011887, -0.07931695,  0.34709905,
        0.66332573, -1.0717208 ,  0.75712906,  0.3942289 , -0.44846918,
        0.61834487,  0.86677929,  0.40062234, -0.06433698,  0.32412661,
        1.81881046, -0.25659378,  0.1657907 ,  1.1879404 ,  1.80158641,
       -1.03987839,  0.56230585, -0.36214389,  1.06764777,  0.1052138 ,
        0.45045435,  0.16407251, -0.60420921,  1.61810703, -0.87380794,
        0.11468668,  0.25411372, -0.41924259, -2.42489247, -0.23111925,
       -2.72410331,  0.31532898,  0.15152504,  1.2053232 ,  0.38110702,
        0.68164975,  0.18895529, -0.85821176, -0.17033702,  0.5425994 ,
        2.24832673, -1.63081825, -0.53917438,  2.41680922, -0.00747583,
       -0.85376451,  1.2196888 ,  1.16589568,  0.31713127, -0.53100074,
        0.17019417, -0.25217197, -0.72007498, -2.57819045,  0.57003734,
        0.22308715,  0.30786769,  1.24612982,  0.70238482,  0.76003046,
       -0.30806491,  1.19115732, -0.9310645 , -0.51721449, -0.96143573,
        0.06446879, -1.16798902, -0.32089517, -0.02135322, -1.6727495 ,
       -0.46386179,  1.89063127, -0.26531393,  1.06408678, -1.58287908,
       -0.92420224, -2.19956758, -0.1343089 , -0.13034877, -0.67785975,
        2.04593005, -1.1069883 ,  0.92339146,  0.34613949,  0.3579397 ,
       -2.00109931,  0.58597139,  1.1110131 , -0.38554453, -0.17519944,
        0.53099396, -0.46474998,  0.03306317,  0.32758416,  0.13723164,
       -0.3029106 ,  0.55101389,  0.64892234,  0.22220512,  0.41736834,
       -0.40278731, -0.92257404, -0.4709706 ,  1.07971809, -2.98458313,
       -1.45542264, -0.51391948,  1.31702519,  0.03543506, -1.16727541,
       -0.88105748,  2.73643199,  0.97248827, -1.41042102,  0.39907719,
       -0.54859373,  0.46252558,  0.60683933,  0.1794711 , -0.24471476,
        1.32748711, -0.79789492,  0.60926951, -1.08152013, -0.87963287,
       -0.38537296, -0.95698381, -0.2431626 , -0.3573572 ,  0.29356553,
       -0.62134141, -0.77314788,  0.90931383,  0.61601119, -0.63935234,
       -0.43878696,  0.76205606,  0.31421953,  2.78144126, -1.52156051,
        2.10574521,  1.11814177,  0.16701422,  0.40596675,  1.34576288,
        1.40415114,  0.06335548, -0.80781649,  0.5926648 ,  0.01537509,
        0.99407383, -0.76417092,  2.70625604,  0.46164874,  0.35997459,
       -0.94031169, -1.29395164,  0.46370337, -1.44845246,  1.06049146,
       -0.38263321,  0.81837133,  2.09298554, -0.29398375,  0.94451859,
        0.57609105,  0.46814336, -1.51491231,  0.23468822, -0.65263943,
        0.71038977,  0.52499587,  0.20679417,  0.88323543, -0.54735462,
        0.79878992,  0.1741608 ,  0.33114483, -0.09574526, -0.14682171,
       -1.44461173, -0.45685533,  0.45345845,  0.6115682 ,  0.51904705,
       -0.08554828, -0.33622008, -0.36839741, -0.27757359,  0.35201071,
        0.7552214 , -1.10422469, -0.1184962 , -0.98011058,  1.6595799 ,
       -1.46347254, -0.4074966 ,  0.29494608, -1.24154882, -0.46094382,
       -0.03102645,  0.77876052, -0.43667225,  0.79975623,  0.55406677,
       -0.20982131, -0.1349337 ,  1.20915455, -0.81934406, -0.09049838,
        0.10558665,  1.08746406, -0.38975061, -0.40291929,  0.80048324,
       -0.49118823, -0.31956532,  1.25231774,  0.71661156,  1.66958084,
        0.78135488, -0.99963037, -0.91906892, -0.05716542,  0.71789594,
        0.16380655, -1.5077756 ,  1.22425423,  1.84231013,  0.78596497,
       -2.26789522, -0.29681176, -0.57445681, -1.56972791, -1.17264528,
        0.02989922, -0.86249079,  0.42151736, -1.28850696,  0.00980887,
        0.96637422, -0.46187205,  0.14531877,  2.04462035, -0.46055019,
        0.87082881, -0.3075837 ,  1.00326032,  2.37476742, -0.82742674,
       -1.48860569,  0.02088268,  0.52631272, -0.99376861, -0.05263605,
        0.68559637, -2.16613173, -1.3522044 , -1.1963832 ,  0.32446162,
       -0.61033679,  0.81991253, -1.01587967,  0.77505944, -0.57161344,
        1.06490296, -0.71751897, -0.48953391, -1.15878859, -1.1435067 ,
       -0.09363471,  0.3786181 ,  0.55190528,  1.03743302,  1.07458943,
        1.60616058,  0.07939234,  1.16516489, -0.31136886, -1.60532113,
        1.52038324, -0.01048865,  0.98744115, -0.42861488,  0.41760295,
       -1.10343746,  0.10330518,  0.07448941, -0.76123027, -0.00932263,
        1.8858055 ,  0.93244288,  0.95165386, -0.18443937, -0.10841579,
        1.78518695,  0.77050207,  0.42570189, -0.93070576, -2.48126406,
       -1.12462066, -0.14778724,  0.68591655, -1.57882008,  0.26041817,
       -1.91811927, -1.13939519, -0.58351585,  0.5393228 , -0.93763943,
       -0.27576519,  1.07326189,  1.45091432,  1.98646322, -1.63669606,
       -0.22110407,  0.05708642,  0.89157443,  0.6773831 , -0.45328847,
        0.18828482, -0.7849523 , -0.75597778,  1.33938298,  2.03413288,
        1.34611984,  0.02390275, -0.37807988,  0.69290908, -0.56671656,
        0.21214352,  0.39739407, -0.65048441, -0.17862337,  1.15991615,
       -0.18010345,  0.20773527,  1.82414791,  2.31429809, -1.33234346,
        2.58395629,  0.8620518 ,  0.1248878 ,  0.50005373, -1.12926529,
        0.50975392, -0.43451591, -0.56476358,  0.99213045,  0.4195942 ,
       -0.24882572, -0.6012761 ,  2.34521358, -1.51791361, -0.76862654,
       -0.84657348, -0.14066758,  1.51677098,  0.74533724,  1.27013831,
        1.54992255, -0.13390535, -0.64879838,  0.06611091,  1.12521902,
        0.79164111,  2.56235106, -0.64998064, -1.62389903, -0.76598062,
       -0.33111142,  0.45239242, -1.04744063, -2.00654811, -0.59340177,
       -0.78459022,  0.15608193, -0.25652688, -0.30624385, -0.84863241,
        1.06820052,  0.82684315,  1.47773412, -0.71614425,  1.4058573 ,
        0.24269234,  1.17804719,  0.35351869,  0.6064892 , -1.10579696,
        0.60685591,  1.45159885,  1.10495497, -0.36527264, -0.73325644,
       -0.2138068 , -0.99140614, -0.53558793, -0.26396861, -1.40318519,
       -0.36346814,  0.18250818,  0.38118535,  1.72574377, -0.09677646,
       -1.7715154 , -0.95293515,  0.54810951,  2.01802103, -1.09010802,
       -1.46836797,  0.27382036, -0.65542243, -0.08072097,  0.79964878,
       -0.68714268,  2.64596575, -0.35157876,  1.42305275, -0.14839079,
       -0.3398626 , -0.02371718, -0.63174479,  1.04582404, -1.38633031,
       -0.1277198 , -0.23355186,  0.44714397, -0.38362092, -0.83351019,
        0.28255316,  0.50703473,  1.33301664,  0.62879607,  0.30090692,
        0.21629363, -1.30483758, -0.35006272,  0.93879891, -0.89711949,
        0.94925748, -0.7272269 , -0.8516216 , -0.04485425, -0.34031907,
        1.34746219,  0.79140262,  0.5771648 ,  0.18621373,  0.50011531,
       -0.61242415, -0.71800228, -0.79940484, -0.64436719,  1.18738083,
        1.674038  , -0.56176705, -0.57165594,  1.32780757,  0.55996429,
       -0.62977843,  0.95216761, -0.37851014,  0.15544106, -0.45438906,
       -0.42508567, -2.81092574,  0.62778316,  0.36031638, -0.19087066,
       -0.75931517,  1.7194422 , -0.87086674, -0.97265463,  0.82501929,
        1.32389475, -0.630964  , -1.3810143 , -0.36472516, -0.51363896,
       -1.86832442,  0.91459473,  0.04019612, -1.03518832, -1.26173468,
       -0.80837655,  0.40311288,  0.51479406,  1.49776292, -1.43356079,
       -0.0768175 , -0.47392131, -0.83979025,  0.56487367,  0.20050762,
       -1.39123725,  0.45315529, -0.55857989, -1.00191219, -0.24595204,
        0.22294978, -0.14544329,  2.08410961, -0.23924853,  0.21623732,
        0.90955281, -0.73063328,  0.66279876, -1.1054102 , -1.28984802,
       -0.04670757,  1.43374949,  0.24924146,  0.01681159, -0.77107609,
       -0.72031971, -1.61705099, -0.25999393, -0.38142751, -0.6141028 ,
        0.43866427,  0.06083963,  0.82538492, -0.64978087,  0.27360923,
       -0.80347641,  0.56963231, -0.10126008, -0.92785142,  0.02977909,
        0.64157495, -0.33488512,  0.94910773,  0.81161767,  1.10414526,
        0.21888547, -0.39397938, -1.38783871,  0.28150305, -2.23463775,
       -1.13800903, -0.09694896, -0.00572937,  0.18060556,  2.1929251 ,
       -0.09650622, -0.46175934,  0.52936614, -0.33712552,  0.87247685,
        0.00846801, -3.18448065, -0.19476269,  0.37569785, -0.07291383,
       -0.41202325,  1.06549086,  0.12794113, -1.48239029, -0.30382291])

In [47]:
cats = pd.qcut(data, 4)

In [48]:
cats

[(0.0132, 0.688], (-0.651, 0.0132], (-0.651, 0.0132], (-3.828, -0.651], (-0.651, 0.0132], ..., (-0.651, 0.0132], (0.688, 3.332], (0.0132, 0.688], (-3.828, -0.651], (-0.651, 0.0132]]
Length: 1000
Categories (4, interval[float64]): [(-3.828, -0.651] < (-0.651, 0.0132] < (0.0132, 0.688] < (0.688, 3.332]]

In [49]:
pd.value_counts(cats)

(0.688, 3.332]      250
(0.0132, 0.688]     250
(-0.651, 0.0132]    250
(-3.828, -0.651]    250
dtype: int64

In [50]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [51]:
data

            0         1         2         3
0   -1.381130 -0.356331 -0.098626  1.802365
1   -0.652522  1.193359  1.794364  1.631314
2   -0.388859 -1.921122 -0.786567  1.030471
3   -0.448289 -0.865679  1.107056  1.326829
4   -0.615888  0.894664 -1.332875  0.816284
5   -0.957505 -0.081830 -0.148197  0.460498
6    0.526771  1.271952  1.989603 -0.281142
7    0.889165 -1.062190 -1.076028  0.858386
8    2.207743 -0.915412  0.971159 -1.420878
9   -0.851179 -0.009435 -0.957038 -0.367379
10   0.273200  0.675181 -1.144139  1.071028
11   0.226193 -0.479349  0.272546  1.238975
12  -2.241177  0.444231 -1.352233 -0.008204
13  -0.226582  0.432125 -0.804830 -2.256128
14  -1.402742 -0.634769  0.207209  0.609138
15  -2.113373 -0.368078 -1.522159  0.139253
16   0.736907 -1.822749 -0.771801  1.318658
17  -0.138619  2.644591  0.569825 -0.020669
18   1.018934  0.852774  0.092204 -1.821678
19  -1.207915 -2.136577 -1.989444 -2.011891
20   0.547142 -0.925198 -1.152869 -1.390651
21  -0.525391 -0.414060  0.977270  1.600940
22   2.351583 -0.671074  1.705224  1.261737
23  -0.143178 -0.685658  0.038118  0.006632
24   0.521959 -0.222727  1.131628 -0.037678
25  -0.152872 -0.776569  1.362917  0.869339
26  -0.415967 -1.046279 -0.188004 -0.065260
27  -0.387912  1.002659  1.016895 -0.898151
28   2.003808  1.858777  0.662387 -1.496474
29   0.918285 -0.288178  0.174248 -0.571770
..        ...       ...       ...       ...
970 -1.412614 -0.414254 -0.153346 -0.596794
971 -1.308029 -1.423388 -1.138759  1.309737
972  1.190093 -0.398280 -1.555318  0.988029
973  0.297823 -0.882325  1.383167 -0.206601
974 -1.826863  0.536952  0.973525 -0.712434
975  0.174008 -0.621131  2.768485 -0.305996
976  0.344334  0.491006  0.273321  0.444782
977 -0.992363  2.052016  0.435316  0.996924
978  0.020328  0.723835 -0.068388  1.603985
979 -2.393275  2.392495  0.959997  0.289141
980  1.164770  0.393279 -0.577416 -0.286159
981  0.528047  0.888684  1.522012  1.036910
982  1.069640  0.636857  0.024461  1.587420
983 -0.409422 -1.035405  0.967428 -0.378646
984  0.646470  0.681802  0.722343  0.876982
985 -0.412603 -0.688123 -1.484387 -0.006630
986 -1.565588  0.240593  0.094739 -0.181981
987  0.835841  0.790943  0.549027  0.692571
988 -0.316244 -0.154126 -1.376349 -1.919326
989  1.054419  0.770931  0.266471 -0.884571
990 -0.591003 -0.439549 -0.879442  1.937841
991  1.740999  0.337004 -0.674237 -0.914482
992  1.464975 -1.184814 -1.928019  0.804324
993  1.693588  0.044029 -0.381261 -0.828121
994 -0.744395 -1.162962 -0.480288 -0.011365
995 -2.090562  0.053480 -0.401948  0.194725
996  0.584148  1.337418  0.647814  0.748012
997 -0.584607  0.233883  0.851375 -0.564555
998 -0.780374 -0.353591  0.740706 -0.624149
999 -0.643912 -2.226828 -0.887509 -0.002681

[1000 rows x 4 columns]

In [52]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.006453    -0.010014    -0.011992     0.023900
std       0.995809     0.983670     1.046150     1.027864
min      -2.979705    -3.426355    -3.165257    -3.533410
25%      -0.640314    -0.677396    -0.749559    -0.653908
50%      -0.044659    -0.036874    -0.013994    -0.007835
75%       0.669652     0.628396     0.735618     0.736387
max       2.925601     2.853855     3.777203     3.050656

In [53]:
col = data[2]
col[np.abs(col) > 3]

164    3.777203
237    3.103366
473    3.313534
620   -3.129202
678   -3.165257
Name: 2, dtype: float64

In [54]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [55]:
sampler = np.random.permutation(5)
sampler

array([0, 4, 3, 1, 2])

In [56]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [57]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [58]:
df.sample(n=3)

   0  1   2   3
1  4  5   6   7
2  8  9  10  11
0  0  1   2   3

In [59]:
choices = pd.Series([5, 7, -1, 6, 4])

In [60]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [61]:
draws = choices.sample(n=10, replace=True)
draws

0    5
4    4
1    7
4    4
3    6
0    5
2   -1
3    6
3    6
3    6
dtype: int64

In [62]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                       'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [64]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [65]:
df_with_dummpy = df[['data1']].join(dummies)

In [66]:
df_with_dummpy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0